example-adapter/examples/xroad-6.4/getFieRequest.xml

<soapenv:Envelope
	xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:xro="http://x-road.eu/xsd/xroad.xsd"
	xmlns:iden="http://x-road.eu/xsd/identifiers">
	<soapenv:Header>
		<xro:client iden:objectType="SUBSYSTEM">
			<iden:xRoadInstance>FI_TEST</iden:xRoadInstance>
			<iden:memberClass>GOV</iden:memberClass>
			<iden:memberCode>1234567-8</iden:memberCode>
			<iden:subsystemCode>TestClient</iden:subsystemCode>
		</xro:client>
		<xro:service iden:objectType="SERVICE">
			<iden:xRoadInstance>FI_TEST</iden:xRoadInstance>
			<iden:memberClass>GOV</iden:memberClass>
			<iden:memberCode>9876543-1</iden:memberCode>
			<iden:subsystemCode>DemoService</iden:subsystemCode>
			<iden:serviceCode>xteeFieAndmed</iden:serviceCode>
			<iden:serviceVersion>v1</iden:serviceVersion>
		</xro:service>
		<xro:id>ID11234</xro:id>
		<xro:userId>EE1234567890</xro:userId>
		<xro:protocolVersion>4.0</xro:protocolVersion>
	</soapenv:Header>
	<soapenv:Body>
		<prod:xteeFieAndmed
			xmlns:prod="http://test.x-road.global/producer">
			<prod:name>&lt;xml version="1.0" encoding="UTF-8" standalone="yes"?&gt;&lt;ns2:xteeFieAndmed xmlns:ns2="http://emta-v6.x-road.eu"&gt;&lt;keha&gt;&lt;isikukood&gt;33309209420223&lt;/isikukood&gt;&lt;/keha&gt;&lt;/ns2:xteeFieAndmed&gt;</prod:name>
		</prod:xteeFieAndmed>
	</soapenv:Body>
</soapenv:Envelope>
